alexeyk13/rexos/arch/cortex_m3/stm/stm32f2xx_regsusb.h
#define  USB_HS_GENERAL_USBCFG_TRDT_POS					(uint32_t)(10ul)
#define  USB_HS_GENERAL_USBCFG_TOCAL_POS		\			(uint32_t)(0ul)

/**********  Bit definition for USB_HS_GENERAL_RSTCTL register  ***************/
#define  USB_HS_GENERAL_RSTCTL_AHBIDL						(uint32_t)(1ul << 31ul)  //AHB master idle
#define  USB_HS_GENERAL_RSTCTL_DMAREQ						(uint32_t)(1ul << 30ul)  //DMA request
#define  USB_HS_GENERAL_RSTCTL_TXFNUM						(uint32_t)(0x1ful << 6ul)//TxFIFO number
#define  USB_HS_GENERAL_RSTCTL_TXFFLSH						(uint32_t)(1ul << 5ul)   //TxFIFO flush
#define  USB_HS_GENERAL_RSTCTL_RXFFLSH						(uint32_t)(1ul << 4ul)   //RxFIFO flush
#define  USB_HS_GENERAL_RSTCTL_FCRST						(uint32_t)(1ul << 2ul)   //Host frame counter reset
#define  USB_HS_GENERAL_RSTCTL_HSRST						(uint32_t)(1ul << 1ul)   //HCLK soft reset
#define  USB_HS_GENERAL_RSTCTL_CSRST						(uint32_t)(1ul << 0ul)   //CORE soft reset

#define  USB_HS_GENERAL_RSTCTL_TXFNUM_POS					(uint32_t)(6ul)

/**********  Bit definition for USB_HS_GENERAL_INTSTS register  ***************/
#define  USB_HS_GENERAL_INTSTS_WKUPINT						(uint32_t)(1ul << 31ul)  //Resume/remote wakeup detected interrupt
#define  USB_HS_GENERAL_INTSTS_SRQINT						(uint32_t)(1ul << 30ul)  //Session request/new session detected interrupt
#define  USB_HS_GENERAL_INTSTS_DISCINT						(uint32_t)(1ul << 29ul)  //Disconnect detected interrupt
#define  USB_HS_GENERAL_INTSTS_CIDSCHG						(uint32_t)(1ul << 28ul)  //Connector ID status change
#define  USB_HS_GENERAL_INTSTS_PTXFE						(uint32_t)(1ul << 26ul)  //Periodic TxFIFO empty
#define  USB_HS_GENERAL_INTSTS_HCINT						(uint32_t)(1ul << 25ul)  //Host channel interrupt
#define  USB_HS_GENERAL_INTSTS_HPRTINT						(uint32_t)(1ul << 24ul)  //Host port interrupt
#define  USB_HS_GENERAL_INTSTS_DATAFSUSP					(uint32_t)(1ul << 22ul)  //Data fetch suspended
#define  USB_HS_GENERAL_INTSTS_IPXFR						(uint32_t)(1ul << 21ul)  //Host: incomplete periodic transfer
#define  USB_HS_GENERAL_INTSTS_INCOMPISOOUT				(uint32_t)(1ul << 21ul)  //Device: incomplete isochronous OUT transfer
#define  USB_HS_GENERAL_INTSTS_ISOIXFR						(uint32_t)(1ul << 20ul)  //Incomplete isochronous transfer
#define  USB_HS_GENERAL_INTSTS_OEPINT						(uint32_t)(1ul << 19ul)  //OUT endpoint interrupt
#define  USB_HS_GENERAL_INTSTS_IEPINT						(uint32_t)(1ul << 18ul)  //IN endpoint interrupt
#define  USB_HS_GENERAL_INTSTS_EOPF							(uint32_t)(1ul << 15ul)  //End of periodic frame interrupt
#define  USB_HS_GENERAL_INTSTS_ISOODRP						(uint32_t)(1ul << 14ul)  //Isochronous OUT packet dropped interrupt
#define  USB_HS_GENERAL_INTSTS_ENUMDNE						(uint32_t)(1ul << 13ul)  //Enumeration done interrupt
#define  USB_HS_GENERAL_INTSTS_USBRST						(uint32_t)(1ul << 12ul)  //USB reset
#define  USB_HS_GENERAL_INTSTS_USBSUSP						(uint32_t)(1ul << 11ul)  //USB suspend
#define  USB_HS_GENERAL_INTSTS_ESUSP						(uint32_t)(1ul << 10ul)  //Early suspend
#define  USB_HS_GENERAL_INTSTS_GONAKEFF					(uint32_t)(1ul << 7ul)   //Global OUT NAK effective
#define  USB_HS_GENERAL_INTSTS_GINAKEFF					(uint32_t)(1ul << 6ul)   //Global OUT nonperiodic NAK effective
#define  USB_HS_GENERAL_INTSTS_NPTXFE						(uint32_t)(1ul << 5ul)   //Nonperiodic TxFIFO empty
#define  USB_HS_GENERAL_INTSTS_RXFLVL						(uint32_t)(1ul << 4ul)   //RxFIFO nonempty
#define  USB_HS_GENERAL_INTSTS_SOF							(uint32_t)(1ul << 3ul)   //Start of frame
#define  USB_HS_GENERAL_INTSTS_OTGINT						(uint32_t)(1ul << 2ul)   //OTG interrupt
#define  USB_HS_GENERAL_INTSTS_MMIS							(uint32_t)(1ul << 1ul)   //Mode mismatch interrupt
#define  USB_HS_GENERAL_INTSTS_CMOD							(uint32_t)(1ul << 0ul)   //Current mode operation

/**********  Bit definition for USB_HS_GENERAL_INTMSK register  ***************/
#define  USB_HS_GENERAL_INTMSK_WKUPM						(uint32_t)(1ul << 31ul)  //Resume/remote wakeup detected interrupt mask
#define  USB_HS_GENERAL_INTMSK_SRQM							(uint32_t)(1ul << 30ul)  //Session request/new session detected interrupt mask
#define  USB_HS_GENERAL_INTMSK_DISCM						(uint32_t)(1ul << 29ul)  //Disconnect detected interrupt mask
#define  USB_HS_GENERAL_INTMSK_CIDSCHGM					(uint32_t)(1ul << 28ul)  //Connector ID status change mask
#define  USB_HS_GENERAL_INTMSK_PTXFEM						(uint32_t)(1ul << 26ul)  //Periodic TxFIFO empty mask
#define  USB_HS_GENERAL_INTMSK_HCM							(uint32_t)(1ul << 25ul)  //Host channel interrupt mask
#define  USB_HS_GENERAL_INTMSK_HPRTM						(uint32_t)(1ul << 24ul)  //Host port interrupt mask
#define  USB_HS_GENERAL_INTMSK_DATAFSUSPM					(uint32_t)(1ul << 22ul)  //Data fetch suspended mask
#define  USB_HS_GENERAL_INTMSK_IPXFRM						(uint32_t)(1ul << 21ul)  //Host: incomplete periodic transfer mask
#define  USB_HS_GENERAL_INTMSK_INCOMPISOOUTM				(uint32_t)(1ul << 21ul)  //Device: incomplete isochronous OUT transfer mask
#define  USB_HS_GENERAL_INTMSK_ISOIXFRM					(uint32_t)(1ul << 20ul)  //Incomplete isochronous transfer mask
#define  USB_HS_GENERAL_INTMSK_OEPM							(uint32_t)(1ul << 19ul)  //OUT endpoint interrupt mask
#define  USB_HS_GENERAL_INTMSK_IEPM							(uint32_t)(1ul << 18ul)  //IN endpoint interrupt mask
#define  USB_HS_GENERAL_INTMSK_EPMISM						(uint32_t)(1ul << 17ul)  //Endpoint mismatch interrupt mask
#define  USB_HS_GENERAL_INTMSK_EOPFM						(uint32_t)(1ul << 15ul)  //End of periodic frame interrupt mask
#define  USB_HS_GENERAL_INTMSK_ISOODRPM					(uint32_t)(1ul << 14ul)  //Isochronous OUT packet dropped interrupt mask
#define  USB_HS_GENERAL_INTMSK_ENUMDNEM					(uint32_t)(1ul << 13ul)  //Enumeration done interrupt mask
#define  USB_HS_GENERAL_INTMSK_USBRSTM						(uint32_t)(1ul << 12ul)  //USB reset mask
#define  USB_HS_GENERAL_INTMSK_USBSUSPM					(uint32_t)(1ul << 11ul)  //USB suspend mask
#define  USB_HS_GENERAL_INTMSK_ESUSPM						(uint32_t)(1ul << 10ul)  //Early suspend mask
#define  USB_HS_GENERAL_INTMSK_GONAKEFFM					(uint32_t)(1ul << 7ul)   //Global OUT NAK effective mask
#define  USB_HS_GENERAL_INTMSK_GINAKEFFM					(uint32_t)(1ul << 6ul)   //Global OUT nonperiodic NAK effective mask
#define  USB_HS_GENERAL_INTMSK_NPTXFEM						(uint32_t)(1ul << 5ul)   //Nonperiodic TxFIFO empty mask
#define  USB_HS_GENERAL_INTMSK_RXFLVLM						(uint32_t)(1ul << 4ul)   //RxFIFO nonempty mask
#define  USB_HS_GENERAL_INTMSK_SOFM							(uint32_t)(1ul << 3ul)   //Start of frame mask
#define  USB_HS_GENERAL_INTMSK_OTGM							(uint32_t)(1ul << 2ul)   //OTG interrupt mask
#define  USB_HS_GENERAL_INTMSK_MMISM						(uint32_t)(1ul << 1ul)   //Mode mismatch interrupt mask

/**********  Bit definition for USB_HS_GENERAL_RXSTSR register  ***************/
#define  USB_HS_GENERAL_RXSTSR_FRMNUM						(uint32_t)(0xful << 21ul)  //Device: frame number
#define  USB_HS_GENERAL_RXSTSR_PKTSTS						(uint32_t)(0xful << 17ul)  //Packet status
#define  USB_HS_GENERAL_RXSTSR_DPID							(uint32_t)(0x3ul << 15ul)  //Data PID
#define  USB_HS_GENERAL_RXSTSR_BCNT							(uint32_t)(0x7fful << 4ul) //Bytes count
#define  USB_HS_GENERAL_RXSTSR_CHNUM						(uint32_t)(0xful << 0ul)   //Host: Channel number
#define  USB_HS_GENERAL_RXSTSR_EPNUM						(uint32_t)(0xful << 0ul)   //Device: EP number

