alexeyk13/rexos/arch/cortex_m3/stm/stm32f2xx_regsusb.h
#define  USB_HS_GENERAL_I2CCTL_I2CDEVADR_POS				(uint32_t)(26ul)
#define  USB_HS_GENERAL_I2CCTL_ADDR_POS					(uint32_t)(16ul)
#define  USB_HS_GENERAL_I2CCTL_REGADDR_POS				(uint32_t)(8ul)
#define  USB_HS_GENERAL_I2CCTL_RWDATA_POS					(uint32_t)(0ul)

/**********  Bit definition for USB_HS_GENERAL_CCFG register  ***************/
#define  USB_HS_GENERAL_CCFG_NOVBUSSENS					(uint32_t)(1ul << 21ul)     //VBus sensing disable option
#define  USB_HS_GENERAL_CCFG_SOFOUTEN						(uint32_t)(1ul << 20ul)     //SOF output enable
#define  USB_HS_GENERAL_CCFG_VBUSBSEN						(uint32_t)(1ul << 19ul)     //Enable VBus sensing "B" device
#define  USB_HS_GENERAL_CCFG_VBUSASEN						(uint32_t)(1ul << 18ul)     //Enable VBus sensing "A" device
#define  USB_HS_GENERAL_CCFG_I2CPADEN						(uint32_t)(1ul << 17ul)     //Enable I2C bus connection for the external I2C PHY interface
#define  USB_HS_GENERAL_CCFG_PWRDWN							(uint32_t)(1ul << 16ul)     //Power down

/*************  Bit definition for USB_HS_GENERAL_CID register  ***************/
#define  USB_HS_GENERAL_CID_PRODUCT_ID						(uint32_t)(0xfffffffful << 0ul)//Product ID

#define  USB_HS_GENERAL_CID_PRODUCT_ID_POS				(uint32_t)(0ul)

/**********  Bit definition for USB_HS_GENERAL_HPTXFSIZ register  ************/
#define  USB_HS_GENERAL_HPTXFSIZ_PTXFD						(uint32_t)(0xfffful << 16ul)//Host periodic TxFIFO depth
#define  USB_HS_GENERAL_HPTXFSIZ_PTXFSA					(uint32_t)(0xfffful << 0ul) //Host periodic TxFIFO start address

#define  USB_HS_GENERAL_HPTXFSIZ_PTXFD_POS				(uint32_t)(16ul)
#define  USB_HS_GENERAL_HPTXFSIZ_PTXFSA_POS				(uint32_t)(0ul)

/**********  Bit definition for USB_HS_GENERAL_DIEPTXF register  ************/
#define  USB_HS_GENERAL_DIEPTXF_INEPTXFD					(uint32_t)(0xfffful << 16ul)//IN endpoint TxFIFO depth
#define  USB_HS_GENERAL_DIEPTXF_INEPTXFSA					(uint32_t)(0xfffful << 0ul) //IN endpoint TxFIFO start address

#define  USB_HS_GENERAL_DIEPTXF_INEPTXFD_POS				(uint32_t)(16ul)
#define  USB_HS_GENERAL_DIEPTXF_INEPTXFSA_POS			(uint32_t)(0ul)

/******************************************************************************/
/*                                                                            */
/*                            USB High Speed HOST                             */
/*                                                                            */
/******************************************************************************/
/**************  Bit definition for USB_HS_HOST_CFG register  *****************/
#define  USB_HS_HOST_CFG_FSLSS								(uint32_t)(1ul << 2ul)	    //FS- and LS-only support
#define  USB_HS_HOST_CFG_FSLSSPCS							(uint32_t)(3ul << 0ul)	    //FS/LS PHY clock select

#define  USB_HS_HOST_CFG_FSLSSPCS_48MHZ					(uint32_t)(1ul << 0ul)	    //PHY clock is running at 48 MHz
#define  USB_HS_HOST_CFG_FSLSSPCS_6MHZ						(uint32_t)(2ul << 0ul)	    //LS 6 MHz PHY clock frequency

/**************  Bit definition for USB_HS_HOST_FIR register  *****************/
#define  USB_HS_HOST_FIR_FRIVL								(uint32_t)(0xfffful << 0ul) //Frame interval

#define  USB_HS_HOST_FIR_FRIVL_POS							(uint32_t)(0ul)

/**************  Bit definition for USB_HS_HOST_FNUM register  *****************/
#define  USB_HS_HOST_FNUM_FTREM								(uint32_t)(0xfffful << 16ul)//Frame time remaining
#define  USB_HS_HOST_FNUM_FRNUM								(uint32_t)(0xfffful << 0ul) //Frame number

#define  USB_HS_HOST_FNUM_FTREM_POS							(uint32_t)(16ul)
#define  USB_HS_HOST_FNUM_FRNUM_POS							(uint32_t)(0ul)

/**************  Bit definition for USB_HS_HOST_PTXSTS register  ***************/
#define  USB_HS_HOST_PTXSTS_PTXQTOP							(uint32_t)(0xfful << 24ul) //Top of the periodic transmit request queue
#define  USB_HS_HOST_PTXSTS_PTXQSAV							(uint32_t)(0xfful << 16ul) //Periodic transmit request queue space available
#define  USB_HS_HOST_PTXSTS_PTXFSAVL						(uint32_t)(0xfffful << 0ul)//Periodic transmit data FIFO space available

#define  USB_HS_HOST_PTXSTS_PTXQTOP_ODD					(uint32_t)(0x1ul << 31ul)   //Odd/Even frame
#define  USB_HS_HOST_PTXSTS_PTXQTOP_CHANNEL				(uint32_t)(0xful << 27ul)   //Channel number
#define  USB_HS_HOST_PTXSTS_PTXQTOP_TYPE					(uint32_t)(0x3ul << 25ul)   //Type
#define  USB_HS_HOST_PTXSTS_PTXQTOP_TERMINATE			(uint32_t)(0x1ul << 24ul)   //Terminate (last entry for the selected channel/endpoint)

#define  USB_HS_HOST_PTXSTS_PTXQTOP_CHANNEL_POS			(uint32_t)(27ul)

#define  USB_HS_HOST_PTXSTS_PTXQTOP_TYPE_IN_OUT			(uint32_t)(0x0ul << 25ul)   //IN/OUT
#define  USB_HS_HOST_PTXSTS_PTXQTOP_TYPE_IN_ZERO_LENGTH(uint32_t)(0x1ul << 25ul)   //Zero-length packet
#define  USB_HS_HOST_PTXSTS_PTXQTOP_TYPE_DISABLE		(uint32_t)(0x3ul << 25ul)   //Disable channel command

#define  USB_HS_HOST_PTXSTS_PTXQSAV_POS					(uint32_t)(16ul)
#define  USB_HS_HOST_PTXSTS_PTXFSAVL_POS					(uint32_t)(0ul)

/**************  Bit definition for USB_HS_HOST_AINT register  ****************/
#define  USB_HS_HOST_AINT_HAINT								(uint32_t)(0xfffful << 0ul) //Channel interrupts

#define  USB_HS_HOST_AINT_HAINT_0							(uint32_t)(0x1ul << 0ul)
#define  USB_HS_HOST_AINT_HAINT_1							(uint32_t)(0x1ul << 1ul)
#define  USB_HS_HOST_AINT_HAINT_2							(uint32_t)(0x1ul << 2ul)
#define  USB_HS_HOST_AINT_HAINT_3							(uint32_t)(0x1ul << 3ul)
#define  USB_HS_HOST_AINT_HAINT_4							(uint32_t)(0x1ul << 4ul)
#define  USB_HS_HOST_AINT_HAINT_5							(uint32_t)(0x1ul << 5ul)
#define  USB_HS_HOST_AINT_HAINT_6							(uint32_t)(0x1ul << 6ul)
#define  USB_HS_HOST_AINT_HAINT_7							(uint32_t)(0x1ul << 7ul)
#define  USB_HS_HOST_AINT_HAINT_8							(uint32_t)(0x1ul << 8ul)
#define  USB_HS_HOST_AINT_HAINT_9							(uint32_t)(0x1ul << 9ul)
#define  USB_HS_HOST_AINT_HAINT_10							(uint32_t)(0x1ul << 10ul)
#define  USB_HS_HOST_AINT_HAINT_11							(uint32_t)(0x1ul << 11ul)
#define  USB_HS_HOST_AINT_HAINT_12							(uint32_t)(0x1ul << 12ul)
#define  USB_HS_HOST_AINT_HAINT_13							(uint32_t)(0x1ul << 13ul)
#define  USB_HS_HOST_AINT_HAINT_14							(uint32_t)(0x1ul << 14ul)
#define  USB_HS_HOST_AINT_HAINT_15							(uint32_t)(0x1ul << 15ul)

/************  Bit definition for USB_HS_HOST_AINTMSK register  ***************/
#define  USB_HS_HOST_AINTMSK_HAINTM							(uint32_t)(0xfffful << 0ul) //Channel interrupts mask

