alexeyk13/rexos/arch/cortex_m3/stm/stm32f2xx_regsusb.h
#define  USB_HS_HOST_AINTMSK_HAINTM_0						(uint32_t)(0x1ul << 0ul)
#define  USB_HS_HOST_AINTMSK_HAINTM_1			\			(uint32_t)(0x1ul << 1ul)
#define  USB_HS_HOST_AINTMSK_HAINTM_2						(uint32_t)(0x1ul << 2ul)
#define  USB_HS_HOST_AINTMSK_HAINTM_3						(uint32_t)(0x1ul << 3ul)
#define  USB_HS_HOST_AINTMSK_HAINTM_4						(uint32_t)(0x1ul << 4ul)
#define  USB_HS_HOST_AINTMSK_HAINTM_5						(uint32_t)(0x1ul << 5ul)
#define  USB_HS_HOST_AINTMSK_HAINTM_6						(uint32_t)(0x1ul << 6ul)
#define  USB_HS_HOST_AINTMSK_HAINTM_7						(uint32_t)(0x1ul << 7ul)
#define  USB_HS_HOST_AINTMSK_HAINTM_8						(uint32_t)(0x1ul << 8ul)
#define  USB_HS_HOST_AINTMSK_HAINTM_9						(uint32_t)(0x1ul << 9ul)
#define  USB_HS_HOST_AINTMSK_HAINTM_10						(uint32_t)(0x1ul << 10ul)
#define  USB_HS_HOST_AINTMSK_HAINTM_11 					(uint32_t)(0x1ul << 11ul)
#define  USB_HS_HOST_AINTMSK_HAINTM_12						(uint32_t)(0x1ul << 12ul)
#define  USB_HS_HOST_AINTMSK_HAINTM_13						(uint32_t)(0x1ul << 13ul)
#define  USB_HS_HOST_AINTMSK_HAINTM_14						(uint32_t)(0x1ul << 14ul)
#define  USB_HS_HOST_AINTMSK_HAINTM_15						(uint32_t)(0x1ul << 15ul)

/**************  Bit definition for USB_HS_HOST_PRT register  ***************/
#define  USB_HS_HOST_PRT_PSPD									(uint32_t)(0x3ul << 17ul) //Port speed
#define  USB_HS_HOST_PRT_PTCTL								(uint32_t)(0xful << 13ul) //Port test control
#define  USB_HS_HOST_PRT_PPWR									(uint32_t)(0x1ul << 12ul) //Port power
#define  USB_HS_HOST_PRT_PLSTS								(uint32_t)(0x3ul << 10ul) //Port line status
#define  USB_HS_HOST_PRT_PRST									(uint32_t)(0x1ul << 8ul)  //Port reset
#define  USB_HS_HOST_PRT_PSUSP								(uint32_t)(0x1ul << 7ul)  //Port suspend
#define  USB_HS_HOST_PRT_PRES									(uint32_t)(0x1ul << 6ul)  //Port resume
#define  USB_HS_HOST_PRT_POCCHNG								(uint32_t)(0x1ul << 5ul)  //Port overcurrent change
#define  USB_HS_HOST_PRT_POCA									(uint32_t)(0x1ul << 4ul)  //Port overcurrent active
#define  USB_HS_HOST_PRT_PENCHNG								(uint32_t)(0x1ul << 3ul)  //Port enable/disable change
#define  USB_HS_HOST_PRT_PENA									(uint32_t)(0x1ul << 2ul)  //Port enable
#define  USB_HS_HOST_PRT_PCDET								(uint32_t)(0x1ul << 1ul)  //Port connect detected
#define  USB_HS_HOST_PRT_PCSTS								(uint32_t)(0x1ul << 0ul)  //Port connect status

#define  USB_HS_HOST_PRT_PSPD_HS								(uint32_t)(0x0ul << 17ul) //High speed
#define  USB_HS_HOST_PRT_PSPD_FS								(uint32_t)(0x1ul << 17ul) //Fast speed
#define  USB_HS_HOST_PRT_PSPD_LS								(uint32_t)(0x2ul << 17ul) //Low speed

#define  USB_HS_HOST_PRT_PTCTL_DISABLED					(uint32_t)(0x0ul << 13ul) //Test mode disabled
#define  USB_HS_HOST_PRT_PTCTL_J								(uint32_t)(0x1ul << 13ul) //J mode
#define  USB_HS_HOST_PRT_PTCTL_K								(uint32_t)(0x2ul << 13ul) //K mode
#define  USB_HS_HOST_PRT_PTCTL_SE0_NAK						(uint32_t)(0x3ul << 13ul) //Se0 NAK mode
#define  USB_HS_HOST_PRT_PTCTL_PACKET						(uint32_t)(0x4ul << 13ul) //Packet mode
#define  USB_HS_HOST_PRT_PTCTL_FORCE_ENABLE				(uint32_t)(0x5ul << 13ul) //Force enable

#define  USB_HS_HOST_PRT_PLSTS_DP							(uint32_t)(0x1ul << 10ul) //Logic level of OTF_HS_FS_DP
#define  USB_HS_HOST_PRT_PLSTS_DM							(uint32_t)(0x1ul << 11ul) //Logic level of OTF_HS_FS_DM

/**********  Bit definition for USB_HS_HOST_CHANNEL_CHAR register  ***************/
#define  USB_HS_HOST_CHANNEL_CHAR_CHENA					(uint32_t)(0x1ul << 31ul) //Channel enable
#define  USB_HS_HOST_CHANNEL_CHAR_CHDIS					(uint32_t)(0x1ul << 30ul) //Channel disable
#define  USB_HS_HOST_CHANNEL_CHAR_ODDFRM					(uint32_t)(0x1ul << 29ul) //ODD frame
#define  USB_HS_HOST_CHANNEL_CHAR_DAD						(uint32_t)(0x7ful << 22ul)//Device address
#define  USB_HS_HOST_CHANNEL_CHAR_MC						(uint32_t)(0x3ul << 20ul) //Multi Count (MC) / Error Count (EC)
#define  USB_HS_HOST_CHANNEL_CHAR_EPTYP					(uint32_t)(0x2ul << 18ul) //Endpoint type
#define  USB_HS_HOST_CHANNEL_CHAR_LSDEV					(uint32_t)(0x1ul << 17ul) //Low speed device
#define  USB_HS_HOST_CHANNEL_CHAR_EPDIR					(uint32_t)(0x1ul << 15ul) //Endpoint direction
#define  USB_HS_HOST_CHANNEL_CHAR_EPNUM					(uint32_t)(0xful << 11ul) //Endpoint number
#define  USB_HS_HOST_CHANNEL_CHAR_MPSIZ					(uint32_t)(0x7fful << 0ul)//Maximum packet size

#define  USB_HS_HOST_CHANNEL_CHAR_DAD_POS					(uint32_t)(22ul)
#define  USB_HS_HOST_CHANNEL_CHAR_MC_POS					(uint32_t)(20ul)

#define  USB_HS_HOST_CHANNEL_CHAR_EPTYP_CONTROL			(uint32_t)(0x0ul << 18ul) //Control endpoint type
#define  USB_HS_HOST_CHANNEL_CHAR_EPTYP_ISOCHRONOUS	(uint32_t)(0x1ul << 18ul) //Isochronous endpoint type
#define  USB_HS_HOST_CHANNEL_CHAR_EPTYP_BULK				(uint32_t)(0x2ul << 18ul) //Bulk endpoint type
#define  USB_HS_HOST_CHANNEL_CHAR_EPTYP_INTERRUPT		(uint32_t)(0x3ul << 18ul) //Interrupt endpoint type

#define  USB_HS_HOST_CHANNEL_CHAR_EPNUM_POS				(uint32_t)(11ul)
#define  USB_HS_HOST_CHANNEL_CHAR_MPSIZ_POS				(uint32_t)(0ul)

/**********  Bit definition for USB_HS_HOST_CHANNEL_SPLT register  ***************/
#define  USB_HS_HOST_CHANNEL_SPLT_SPLTEN					(uint32_t)(0x1ul << 31ul) //Split enable
#define  USB_HS_HOST_CHANNEL_SPLT_COMPLSPLT				(uint32_t)(0x1ul << 16ul) //Do complete split
#define  USB_HS_HOST_CHANNEL_SPLT_XACTPOS					(uint32_t)(0x3ul << 14ul) //Transaction position
#define  USB_HS_HOST_CHANNEL_SPLT_HUBADDR					(uint32_t)(0x7ful << 7ul) //Hub address
#define  USB_HS_HOST_CHANNEL_SPLT_PORTADDR				(uint32_t)(0x7ful << 0ul) //Port address

#define  USB_HS_HOST_CHANNEL_SPLT_XACTPOS_ALL			(uint32_t)(0x3ul << 14ul) //All. This is the entire data payload of this transaction (which is less than or equal to 188 bytes)
#define  USB_HS_HOST_CHANNEL_SPLT_XACTPOS_BEGIN			(uint32_t)(0x2ul << 14ul) //Begin. This is the first data payload of this transaction (which is larger than 188 bytes)
#define  USB_HS_HOST_CHANNEL_SPLT_XACTPOS_MID			(uint32_t)(0x0ul << 14ul) //Mid. This is the middle payload of this transaction (which is larger than 188 bytes)
#define  USB_HS_HOST_CHANNEL_SPLT_XACTPOS_END			(uint32_t)(0x1ul << 14ul) //End. This is the last payload of this transaction (which is larger than 188 bytes)

