alexeyk13/rexos/arch/cortex_m3/stm/stm32f2xx_regsusb.h
#define  USB_HS_HOST_CHANNEL_SPLT_HUBADDR_POS			(uint32_t)(7ul)
#define  USB_HS_HOST_CHANNEL_SPLT_PORTADDR_POS			(uint32_t)(0ul)

/**********  Bit definition for USB_HS_HOST_CHANNEL_INT register  ****************/
#define  USB_HS_HOST_CHANNEL_INT_DTERR						(uint32_t)(0x1ul << 10ul) //Data toggle error
#define  USB_HS_HOST_CHANNEL_INT_FRMOR						(uint32_t)(0x1ul << 9ul)  //Frame overrun
#define  USB_HS_HOST_CHANNEL_INT_BBERR						(uint32_t)(0x1ul << 8ul)  //Babble error
#define  USB_HS_HOST_CHANNEL_INT_TXERR						(uint32_t)(0x1ul << 7ul)  //Transaction error
#define  USB_HS_HOST_CHANNEL_INT_NYET						(uint32_t)(0x1ul << 6ul)  //Responce received interrupt
#define  USB_HS_HOST_CHANNEL_INT_ACK						(uint32_t)(0x1ul << 5ul)  //ACK response received/transmitted interrupt
#define  USB_HS_HOST_CHANNEL_INT_NAK						(uint32_t)(0x1ul << 4ul)  //NAK response received interrupt
#define  USB_HS_HOST_CHANNEL_INT_STALL						(uint32_t)(0x1ul << 3ul)  //STALL response received interrupt
#define  USB_HS_HOST_CHANNEL_INT_AHBERR					(uint32_t)(0x1ul << 2ul)  //AHB error
#define  USB_HS_HOST_CHANNEL_INT_CHH						(uint32_t)(0x1ul << 1ul)  //Channel halted
#define  USB_HS_HOST_CHANNEL_INT_XFRC						(uint32_t)(0x1ul << 0ul)  //Transfer completed

/**********  Bit definition for USB_HS_HOST_CHANNEL_INTMSK register  *************/
#define  USB_HS_HOST_CHANNEL_INTMSK_DTERRM				(uint32_t)(0x1ul << 10ul) //Data toggle error interrupt mask
#define  USB_HS_HOST_CHANNEL_INTMSK_FRMORM				(uint32_t)(0x1ul << 9ul)  //Frame overrun interrupt mask
#define  USB_HS_HOST_CHANNEL_INTMSK_BBERR					(uint32_t)(0x1ul << 8ul)  //Babble error interrupt mask
#define  USB_HS_HOST_CHANNEL_INTMSK_TXERRM				(uint32_t)(0x1ul << 7ul)  //Transaction error interrupt mask
#define  USB_HS_HOST_CHANNEL_INTMSK_NYETM					(uint32_t)(0x1ul << 6ul)  //Responce received interrupt mask
#define  USB_HS_HOST_CHANNEL_INTMSK_ACKM					(uint32_t)(0x1ul << 5ul)  //ACK response received/transmitted interrupt mask
#define  USB_HS_HOST_CHANNEL_INTMSK_NAKM					(uint32_t)(0x1ul << 4ul)  //NAK response received interrupt mask
#define  USB_HS_HOST_CHANNEL_INTMSK_STALLM				(uint32_t)(0x1ul << 3ul)  //STALL response received interrupt mask
#define  USB_HS_HOST_CHANNEL_INTMSK_AHBERRM				(uint32_t)(0x1ul << 2ul)  //AHB error interrupt mask
#define  USB_HS_HOST_CHANNEL_INTMSK_CHHM					(uint32_t)(0x1ul << 1ul)  //Channel halted interrupt mask
#define  USB_HS_HOST_CHANNEL_INTMSK_XFRCM					(uint32_t)(0x1ul << 0ul)  //Transfer completed interrupt mask

/**********  Bit definition for USB_HS_HOST_CHANNEL_TSIZ register  ***************/
#define  USB_HS_HOST_CHANNEL_TSIZ_DOPING					(uint32_t)(0x1ul << 31ul) //Do ping
#define  USB_HS_HOST_CHANNEL_TSIZ_DPID						(uint32_t)(0x3ul << 29ul) //Data PID
#define  USB_HS_HOST_CHANNEL_TSIZ_PKTCNT					(uint32_t)(0x3fful << 19ul)//Packet count
#define  USB_HS_HOST_CHANNEL_TSIZ_XFRSIZ					(uint32_t)(0x7fffful << 0ul)//Transfer size

#define  USB_HS_HOST_CHANNEL_TSIZ_DPID_DATA0				(uint32_t)(0x0ul << 29ul) //DATA0
#define  USB_HS_HOST_CHANNEL_TSIZ_DPID_DATA2				(uint32_t)(0x1ul << 29ul) //DATA2
#define  USB_HS_HOST_CHANNEL_TSIZ_DPID_DATA1				(uint32_t)(0x2ul << 29ul) //DATA1
#define  USB_HS_HOST_CHANNEL_TSIZ_DPID_MDATA_SETUP		(uint32_t)(0x3ul << 29ul) //MDATA (noncontrol)/SETUP (control)

#define  USB_HS_HOST_CHANNEL_TSIZ_PKTCNT_POS				(uint32_t)(19ul)
#define  USB_HS_HOST_CHANNEL_TSIZ_XFRSIZ_POS				(uint32_t)(0ul)

/**********  Bit definition for USB_HS_HOST_CHANNEL_DMA register  ***************/
#define  USB_HS_HOST_CHANNEL_DMA_DMAADDR					(uint32_t)(0xfffffffful << 0ul)//DMA address

#define  USB_HS_HOST_CHANNEL_DMA_DMAADDR_POS				(uint32_t)(0ul)

/******************************************************************************/
/*                                                                            */
/*                            USB High Speed DEVICE                           */
/*                                                                            */
/******************************************************************************/
/**************  Bit definition for USB_HS_DEVICE_CFG register  ***************/
#define  USB_HS_DEVICE_CFG_PERSCHIVL						(uint32_t)(3ul << 25ul)	  //Periodic scheduling interval
#define  USB_HS_DEVICE_CFG_PFIVL								(uint32_t)(3ul << 11ul)	  //Periodic frame interval
#define  USB_HS_DEVICE_CFG_DAD								(uint32_t)(0x7ful << 4ul)	  //Device address
#define  USB_HS_DEVICE_CFG_NZLSOHSK							(uint32_t)(1ul << 1ul)	  //Non-zero length status OUT handshake
#define  USB_HS_DEVICE_CFG_DSPD								(uint32_t)(3ul << 0ul)	  //Device speed

#define  USB_HS_DEVICE_CFG_PERSCHIVL_25					(uint32_t)(0ul << 25ul)	  //25% of micro(frame)
#define  USB_HS_DEVICE_CFG_PERSCHIVL_50					(uint32_t)(1ul << 25ul)	  //50% of micro(frame)
#define  USB_HS_DEVICE_CFG_PERSCHIVL_75					(uint32_t)(2ul << 25ul)	  //75% of micro(frame)

#define  USB_HS_DEVICE_CFG_PFIVL_80							(uint32_t)(0ul << 11ul)	  //80% of micro(frame)
#define  USB_HS_DEVICE_CFG_PFIVL_85							(uint32_t)(1ul << 11ul)	  //85% of micro(frame)
#define  USB_HS_DEVICE_CFG_PFIVL_90							(uint32_t)(2ul << 11ul)	  //90% of micro(frame)
#define  USB_HS_DEVICE_CFG_PFIVL_95							(uint32_t)(3ul << 11ul)	  //95% of micro(frame)

#define  USB_HS_DEVICE_CFG_DAD_POS							(uint32_t)(4ul)

#define  USB_HS_DEVICE_CFG_DSPD_HS							(uint32_t)(0ul << 0ul)	  //High speed
#define  USB_HS_DEVICE_CFG_DSPD_FS							(uint32_t)(3ul << 0ul)	  //Full speed (USB tranceiver clock is 48MHz)

/**************  Bit definition for USB_HS_DEVICE_CTL register  ***************/
#define  USB_HS_DEVICE_CTL_POPRGDNE							(uint32_t)(1ul << 11ul)	  //Power-on programming done
#define  USB_HS_DEVICE_CTL_CGONAK							(uint32_t)(1ul << 10ul)	  //Clear global OUT NAK
#define  USB_HS_DEVICE_CTL_SGONAK							(uint32_t)(1ul << 9ul)	  //Set global OUT NAK
#define  USB_HS_DEVICE_CTL_CGINAK							(uint32_t)(1ul << 8ul)	  //Clear global IN NAK
#define  USB_HS_DEVICE_CTL_SGINAK							(uint32_t)(1ul << 7ul)	  //Set global IN NAK
#define  USB_HS_DEVICE_CTL_TCTL								(uint32_t)(7ul << 4ul)	  //Test control
#define  USB_HS_DEVICE_CTL_GONSTS							(uint32_t)(1ul << 3ul)	  //Global OUT NAK status
#define  USB_HS_DEVICE_CTL_GINSTS							(uint32_t)(1ul << 2ul)	  //Global IN NAK status
#define  USB_HS_DEVICE_CTL_SDIS								(uint32_t)(1ul << 1ul)	  //Soft disconnect
#define  USB_HS_DEVICE_CTL_RWUSIG							(uint32_t)(1ul << 0ul)	  //Remote wakeup signaling

