alexeyk13/rexos/arch/cortex_m3/stm/stm32f2xx_regsusb.h
#define  USB_HS_DEVICE_CTL_TCTL_DISABLED					(uint32_t)(0x0ul << 4ul)  //Test mode disabled
#define  USB_HS_DEVICE_CTL_TCTL_J							(uint32_t)(0x1ul << 4ul)  //J mode
#define  USB_HS_DEVICE_CTL_TCTL_K							(uint32_t)(0x2ul << 4ul)  //K mode
#define  USB_HS_DEVICE_CTL_TCTL_SE0_NAK					(uint32_t)(0x3ul << 4ul)  //Se0 NAK mode
#define  USB_HS_DEVICE_CTL_TCTL_PACKET						(uint32_t)(0x4ul << 4ul)  //Packet mode
#define  USB_HS_DEVICE_CTL_TCTL_FORCE_ENABLE				(uint32_t)(0x5ul << 4ul)  //Force enable

/**************  Bit definition for USB_HS_DEVICE_STS register  ***************/
#define  USB_HS_DEVICE_STS_FNSOF								(uint32_t)(0x3ffful << 8ul)//Frame number of received SOF
#define  USB_HS_DEVICE_STS_EERR								(uint32_t)(1ul << 3ul)		//Erratic error
#define  USB_HS_DEVICE_STS_ENUMSPD							(uint32_t)(3ul << 1ul)		//Enumerated speed
#define  USB_HS_DEVICE_STS_SUSPSTS							(uint32_t)(1ul << 0ul)		//Suspend status

#define  USB_HS_DEVICE_STS_FNSOF_POS						(uint32_t)(8ul)

#define  USB_HS_DEVICE_STS_ENUMSPD_HS						(uint32_t)(0ul << 1ul)		//High speed
#define  USB_HS_DEVICE_STS_ENUMSPD_FS						(uint32_t)(3ul << 1ul)		//Full speed (PHY clock is running on 48MHz)

/************  Bit definition for USB_HS_DEVICE_IEPMSK register  ***************/
#define  USB_HS_DEVICE_IEPMSK_BIM							(uint32_t)(1ul << 9ul)		//BNA interrupt mask
#define  USB_HS_DEVICE_IEPMSK_TXFURM						(uint32_t)(1ul << 8ul)		//Tx FIFO underrun mask
#define  USB_HS_DEVICE_IEPMSK_INEPNEM						(uint32_t)(1ul << 6ul)		//IN endpoint NAK effective mask
#define  USB_HS_DEVICE_IEPMSK_INEPNMM						(uint32_t)(1ul << 5ul)		//IN token receive with EP mismatch mask
#define  USB_HS_DEVICE_IEPMSK_ITTXFEMSK					(uint32_t)(1ul << 4ul)		//IN token receive when TxFIFO empty mask
#define  USB_HS_DEVICE_IEPMSK_TOCM							(uint32_t)(1ul << 3ul)		//Timeout condition mask (nonisochronous endpoint)
#define  USB_HS_DEVICE_IEPMSK_EPDM							(uint32_t)(1ul << 1ul)		//Endpoint disabled interrupt mask
#define  USB_HS_DEVICE_IEPMSK_XFRCM							(uint32_t)(1ul << 0ul)		//Transfer completed interrupt mask

/************  Bit definition for USB_HS_DEVICE_OEPMSK register  ***************/
#define  USB_HS_DEVICE_OEPMSK_BOIM							(uint32_t)(1ul << 9ul)		//BNA interrupt mask
#define  USB_HS_DEVICE_OEPMSK_OPEM							(uint32_t)(1ul << 8ul)		//OUT packet error mask
#define  USB_HS_DEVICE_OEPMSK_B2BSTUP						(uint32_t)(1ul << 6ul)		//Back-to-back SETUP packets received mask
#define  USB_HS_DEVICE_OEPMSK_OTEPDM						(uint32_t)(1ul << 4ul)		//OUT token received when endpoint disabled mask
#define  USB_HS_DEVICE_OEPMSK_STUPM							(uint32_t)(1ul << 3ul)		//SETUP phase done mask
#define  USB_HS_DEVICE_OEPMSK_EPDM							(uint32_t)(1ul << 1ul)		//Endpoint disabled interrupt mask
#define  USB_HS_DEVICE_OEPMSK_XFRCM							(uint32_t)(1ul << 0ul)		//Transfer completed interrupt mask

/************  Bit definition for USB_HS_DEVICE_AINT register  *****************/
#define  USB_HS_DEVICE_AINT_OEPINT							(uint32_t)(0xfffful << 16ul)//OUT endpoint interrupt bits
#define  USB_HS_DEVICE_AINT_IEPINT							(uint32_t)(0xfffful << 0ul) //IN endpoint interrupt bits

#define  USB_HS_DEVICE_AINT_OEPINT_POS						(uint32_t)(16ul)
#define  USB_HS_DEVICE_AINT_IEPINT_POS						(uint32_t)(0ul)

#define  USB_HS_DEVICE_AINT_OEPINT_0						(uint32_t)(1ul << 16ul)
#define  USB_HS_DEVICE_AINT_OEPINT_1						(uint32_t)(1ul << 17ul)
#define  USB_HS_DEVICE_AINT_OEPINT_2						(uint32_t)(1ul << 18ul)
#define  USB_HS_DEVICE_AINT_OEPINT_3						(uint32_t)(1ul << 19ul)
#define  USB_HS_DEVICE_AINT_OEPINT_4						(uint32_t)(1ul << 20ul)
#define  USB_HS_DEVICE_AINT_OEPINT_5						(uint32_t)(1ul << 21ul)
#define  USB_HS_DEVICE_AINT_OEPINT_6						(uint32_t)(1ul << 22ul)
#define  USB_HS_DEVICE_AINT_OEPINT_7						(uint32_t)(1ul << 23ul)
#define  USB_HS_DEVICE_AINT_OEPINT_8						(uint32_t)(1ul << 24ul)
#define  USB_HS_DEVICE_AINT_OEPINT_9						(uint32_t)(1ul << 25ul)
#define  USB_HS_DEVICE_AINT_OEPINT_10						(uint32_t)(1ul << 26ul)
#define  USB_HS_DEVICE_AINT_OEPINT_11						(uint32_t)(1ul << 27ul)
#define  USB_HS_DEVICE_AINT_OEPINT_12						(uint32_t)(1ul << 28ul)
#define  USB_HS_DEVICE_AINT_OEPINT_13						(uint32_t)(1ul << 29ul)
#define  USB_HS_DEVICE_AINT_OEPINT_14						(uint32_t)(1ul << 30ul)
#define  USB_HS_DEVICE_AINT_OEPINT_15						(uint32_t)(1ul << 31ul)

#define  USB_HS_DEVICE_AINT_IEPINT_0						(uint32_t)(1ul << 0ul)
#define  USB_HS_DEVICE_AINT_IEPINT_1						(uint32_t)(1ul << 1ul)
#define  USB_HS_DEVICE_AINT_IEPINT_2						(uint32_t)(1ul << 2ul)
#define  USB_HS_DEVICE_AINT_IEPINT_3						(uint32_t)(1ul << 3ul)
#define  USB_HS_DEVICE_AINT_IEPINT_4						(uint32_t)(1ul << 4ul)
#define  USB_HS_DEVICE_AINT_IEPINT_5						(uint32_t)(1ul << 5ul)
#define  USB_HS_DEVICE_AINT_IEPINT_6						(uint32_t)(1ul << 6ul)
#define  USB_HS_DEVICE_AINT_IEPINT_7						(uint32_t)(1ul << 7ul)
#define  USB_HS_DEVICE_AINT_IEPINT_8						(uint32_t)(1ul << 8ul)
#define  USB_HS_DEVICE_AINT_IEPINT_9						(uint32_t)(1ul << 9ul)
#define  USB_HS_DEVICE_AINT_IEPINT_10						(uint32_t)(1ul << 10ul)
#define  USB_HS_DEVICE_AINT_IEPINT_11						(uint32_t)(1ul << 11ul)
#define  USB_HS_DEVICE_AINT_IEPINT_12						(uint32_t)(1ul << 12ul)
#define  USB_HS_DEVICE_AINT_IEPINT_13						(uint32_t)(1ul << 13ul)
#define  USB_HS_DEVICE_AINT_IEPINT_14						(uint32_t)(1ul << 14ul)
#define  USB_HS_DEVICE_AINT_IEPINT_15						(uint32_t)(1ul << 15ul)

/************  Bit definition for USB_HS_DEVICE_AINTMSK register  *****************/
#define  USB_HS_DEVICE_AINTMSK_OEPINTM						(uint32_t)(0xfffful << 16ul)//OUT endpoint interrupt mask bits
#define  USB_HS_DEVICE_AINTMSK_IEPINTM						(uint32_t)(0xfffful << 0ul) //IN endpoint interrupt mask bits

#define  USB_HS_DEVICE_AINTMSK_OEPINTM_POS				(uint32_t)(16ul)
#define  USB_HS_DEVICE_AINTMSK_IEPINTM_POS				(uint32_t)(0ul)

#define  USB_HS_DEVICE_AINTMSK_OEPINTM_0					(uint32_t)(1ul << 16ul)
#define  USB_HS_DEVICE_AINTMSK_OEPINTM_1					(uint32_t)(1ul << 17ul)
#define  USB_HS_DEVICE_AINTMSK_OEPINTM_2					(uint32_t)(1ul << 18ul)
#define  USB_HS_DEVICE_AINTMSK_OEPINTM_3					(uint32_t)(1ul << 19ul)
#define  USB_HS_DEVICE_AINTMSK_OEPINTM_4					(uint32_t)(1ul << 20ul)
#define  USB_HS_DEVICE_AINTMSK_OEPINTM_5					(uint32_t)(1ul << 21ul)
#define  USB_HS_DEVICE_AINTMSK_OEPINTM_6					(uint32_t)(1ul << 22ul)
#define  USB_HS_DEVICE_AINTMSK_OEPINTM_7					(uint32_t)(1ul << 23ul)
#define  USB_HS_DEVICE_AINTMSK_OEPINTM_8					(uint32_t)(1ul << 24ul)
#define  USB_HS_DEVICE_AINTMSK_OEPINTM_9					(uint32_t)(1ul << 25ul)
#define  USB_HS_DEVICE_AINTMSK_OEPINTM_10					(uint32_t)(1ul << 26ul)
#define  USB_HS_DEVICE_AINTMSK_OEPINTM_11					(uint32_t)(1ul << 27ul)
#define  USB_HS_DEVICE_AINTMSK_OEPINTM_12					(uint32_t)(1ul << 28ul)
#define  USB_HS_DEVICE_AINTMSK_OEPINTM_13					(uint32_t)(1ul << 29ul)
#define  USB_HS_DEVICE_AINTMSK_OEPINTM_14					(uint32_t)(1ul << 30ul)
#define  USB_HS_DEVICE_AINTMSK_OEPINTM_15					(uint32_t)(1ul << 31ul)

#define  USB_HS_DEVICE_AINTMSK_IEPINTM_0					(uint32_t)(1ul << 0ul)
#define  USB_HS_DEVICE_AINTMSK_IEPINTM_1					(uint32_t)(1ul << 1ul)
#define  USB_HS_DEVICE_AINTMSK_IEPINTM_2					(uint32_t)(1ul << 2ul)
#define  USB_HS_DEVICE_AINTMSK_IEPINTM_3					(uint32_t)(1ul << 3ul)
#define  USB_HS_DEVICE_AINTMSK_IEPINTM_4					(uint32_t)(1ul << 4ul)
#define  USB_HS_DEVICE_AINTMSK_IEPINTM_5					(uint32_t)(1ul << 5ul)
#define  USB_HS_DEVICE_AINTMSK_IEPINTM_6					(uint32_t)(1ul << 6ul)
#define  USB_HS_DEVICE_AINTMSK_IEPINTM_7					(uint32_t)(1ul << 7ul)
#define  USB_HS_DEVICE_AINTMSK_IEPINTM_8					(uint32_t)(1ul << 8ul)
#define  USB_HS_DEVICE_AINTMSK_IEPINTM_9					(uint32_t)(1ul << 9ul)
#define  USB_HS_DEVICE_AINTMSK_IEPINTM_10					(uint32_t)(1ul << 10ul)
#define  USB_HS_DEVICE_AINTMSK_IEPINTM_11					(uint32_t)(1ul << 11ul)
#define  USB_HS_DEVICE_AINTMSK_IEPINTM_12					(uint32_t)(1ul << 12ul)
#define  USB_HS_DEVICE_AINTMSK_IEPINTM_13					(uint32_t)(1ul << 13ul)
#define  USB_HS_DEVICE_AINTMSK_IEPINTM_14					(uint32_t)(1ul << 14ul)
#define  USB_HS_DEVICE_AINTMSK_IEPINTM_15					(uint32_t)(1ul << 15ul)

/************  Bit definition for USB_HS_DEVICE_VBUSDIS register  ***************/
#define  USB_HS_DEVICE_VBUSDIS_VBUSDT						(uint32_t)(0xfffful << 0ul) //VBus discharge time

#define  USB_HS_DEVICE_VBUSDIS_VBUSDT_POS					(uint32_t)(0ul)

/************  Bit definition for USB_HS_DEVICE_VBUSPULSE register  ***************/
#define  USB_HS_DEVICE_VBUSPULSE_VBUSP						(uint32_t)(0xffful << 0ul) //VBus pulse time

#define  USB_HS_DEVICE_VBUSPULSE_VBUSP_POS				(uint32_t)(0ul)

/************  Bit definition for USB_HS_DEVICE_THRCTL register  ******************/
#define  USB_HS_DEVICE_THRCTL_ARPEN							(uint32_t)(1ul << 27ul)		//Arbiter parking enable
#define  USB_HS_DEVICE_THRCTL_RXTHRLEN						(uint32_t)(0x1fful << 17ul)//Receive threshold length
#define  USB_HS_DEVICE_THRCTL_RXTHREN						(uint32_t)(1ul << 16ul)		//Receive threshold enable
#define  USB_HS_DEVICE_THRCTL_TXTHRLEN						(uint32_t)(0x1fful << 2ul)	//Transmit threshold length
#define  USB_HS_DEVICE_THRCTL_ISOTHREN						(uint32_t)(1ul << 1ul)		//Isochronous IN threshold enable
#define  USB_HS_DEVICE_THRCTL_NONISOTHREN					(uint32_t)(1ul << 0ul)		//Non-isochronous threshold enable

#define  USB_HS_DEVICE_THRCTL_RXTHRLEN_POS				(uint32_t)(17ul)
#define  USB_HS_DEVICE_THRCTL_TXTHRLEN_POS				(uint32_t)(2ul)

/************  Bit definition for USB_HS_DEVICE_IEPEMPMSK register  ***************/
#define  USB_HS_DEVICE_IEPEMPMSK_INEPTXFEM				(uint32_t)(0xfffful << 0ul)//IN EP TxFIFO empty interrupt mask bits

#define  USB_HS_DEVICE_IEPEMPMSK_INEPTXFEM_POS			(uint32_t)(0ul)

