alexeyk13/rexos/arch/cortex_m3/stm/stm32f2xx_regsusb.h
/************  Bit definition for USB_HS_DEVICE_EACHINT register  *****************/
#define  USB_HS_DEVICE_EACHINT_OEP1INT						(uint32_t)(1ul << 17ul)		//OUT endpoint 1 interrupt bit
#define  USB_HS_DEVICE_EACHINT_IEP1INT						(uint32_t)(1ul << 1ul)		//IN endpoint 1 interrupt bit

/************  Bit definition for USB_HS_DEVICE_EACHINTMSK register  **************/
#define  USB_HS_DEVICE_EACHINTMSK_OEP1INTM				(uint32_t)(1ul << 17ul)		//OUT endpoint 1 interrupt mask bit
#define  USB_HS_DEVICE_EACHINTMSK_IEP1INTM				(uint32_t)(1ul << 1ul)		//IN endpoint 1 interrupt mask bit

/************  Bit definition for USB_HS_DEVICE_IEPEACHMSK1 register **************/
#define  USB_HS_DEVICE_IEPEACHMSK1_NAKM					(uint32_t)(1ul << 13ul)		//NAK interrupt mask
#define  USB_HS_DEVICE_IEPEACHMSK1_BIM						(uint32_t)(1ul << 9ul)		//BNA interrupt mask
#define  USB_HS_DEVICE_IEPEACHMSK1_TXFURM					(uint32_t)(1ul << 8ul)		//Tx FIFO underrun mask
#define  USB_HS_DEVICE_IEPEACHMSK1_INEPNEM				(uint32_t)(1ul << 6ul)		//IN endpoint NAK effective mask
#define  USB_HS_DEVICE_IEPEACHMSK1_INEPNMM				(uint32_t)(1ul << 5ul)		//IN token receive with EP mismatch mask
#define  USB_HS_DEVICE_IEPEACHMSK1_ITTXFEMSK				(uint32_t)(1ul << 4ul)		//IN token receive when TxFIFO empty mask
#define  USB_HS_DEVICE_IEPEACHMSK1_TOM						(uint32_t)(1ul << 3ul)		//Timeout condition mask (nonisochronous endpoint)
#define  USB_HS_DEVICE_IEPEACHMSK1_EPDM					(uint32_t)(1ul << 1ul)		//Endpoint disabled interrupt mask
#define  USB_HS_DEVICE_IEPEACHMSK1_XFRCM					(uint32_t)(1ul << 0ul)		//Transfer completed interrupt mask

/************  Bit definition for USB_HS_DEVICE_OEPEACHMSK1 register  ***************/
#define  USB_HS_DEVICE_OEPEACHMSK1_NYETM					(uint32_t)(1ul << 14ul)		//NYET interrupt mask
#define  USB_HS_DEVICE_OEPEACHMSK1_NAKM					(uint32_t)(1ul << 13ul)		//NAK interrupt mask
#define  USB_HS_DEVICE_OEPEACHMSK1_BERRM					(uint32_t)(1ul << 12ul)		//Bubble error interrupt mask
#define  USB_HS_DEVICE_OEPEACHMSK1_BOIM					(uint32_t)(1ul << 9ul)		//BNA interrupt mask
#define  USB_HS_DEVICE_OEPEACHMSK1_OPEM					(uint32_t)(1ul << 8ul)		//OUT packet error mask
#define  USB_HS_DEVICE_OEPEACHMSK1_AHBERRM				(uint32_t)(1ul << 2ul)		//AHB error mask
#define  USB_HS_DEVICE_OEPEACHMSK1_EPDM					(uint32_t)(1ul << 1ul)		//Endpoint disabled interrupt mask
#define  USB_HS_DEVICE_OEPEACHMSK1_XFRCM					(uint32_t)(1ul << 0ul)		//Transfer completed interrupt mask

/************  Bit definition for USB_HS_DEVICE_ENDPOINT_CTL register  **************/
#define  USB_HS_DEVICE_ENDPOINT_CTL_EPENA					(uint32_t)(1ul << 31ul)		//EP enable
#define  USB_HS_DEVICE_ENDPOINT_CTL_EPDIS					(uint32_t)(1ul << 30ul)		//EP disable
#define  USB_HS_DEVICE_ENDPOINT_CTL_SODDFRM				(uint32_t)(1ul << 29ul)		//Isochronous: set odd frame
#define  USB_HS_DEVICE_ENDPOINT_CTL_SD0PID				(uint32_t)(1ul << 28ul)		//Interrupt/bulk: set DATA0 PID
#define  USB_HS_DEVICE_ENDPOINT_CTL_SEVNFRM				(uint32_t)(1ul << 28ul)		//Isochronous: set even frame
#define  USB_HS_DEVICE_ENDPOINT_CTL_SNAK					(uint32_t)(1ul << 27ul)		//Set NAK
#define  USB_HS_DEVICE_ENDPOINT_CTL_CNAK					(uint32_t)(1ul << 26ul)		//Clear NAK
#define  USB_HS_DEVICE_ENDPOINT_CTL_TXFNUM				(uint32_t)(0xful << 22ul)	//TX FIFO NUM
#define  USB_HS_DEVICE_ENDPOINT_CTL_TXFNUM_POS			(uint32_t)(22ul)
#define  USB_HS_DEVICE_ENDPOINT_CTL_STALL					(uint32_t)(1ul << 21ul)		//Set STALL
#define  USB_HS_DEVICE_ENDPOINT_CTL_SNPM					(uint32_t)(1ul << 20ul)		//Snoop mode
#define  USB_HS_DEVICE_ENDPOINT_CTL_EPTYP					(uint32_t)(3ul << 18ul)		//EP type
#define  USB_HS_DEVICE_ENDPOINT_CTL_NAKSTS				(uint32_t)(1ul << 17ul)		//NAK status
#define  USB_HS_DEVICE_ENDPOINT_CTL_EONUM					(uint32_t)(1ul << 16ul)		//Isochronous: even/odd frame
#define  USB_HS_DEVICE_ENDPOINT_CTL_DPID					(uint32_t)(1ul << 16ul)		//Interrupt/bulk: data PID
#define  USB_HS_DEVICE_ENDPOINT_CTL_USBAEP				(uint32_t)(1ul << 15ul)		//USB active endpoint
#define  USB_HS_DEVICE_ENDPOINT_CTL_MPSIZ					(uint32_t)(0x7fful << 0ul)	//Maximum packet size
#define  USB_HS_DEVICE_ENDPOINT_CTL_MPSIZ0				(uint32_t)(3ul << 0ul)		//Maximum packet size for EP0

#define  USB_HS_DEVICE_ENDPOINT_CTL_EPTYP_CONTROL		(uint32_t)(0ul << 18ul)		//Control EP type
#define  USB_HS_DEVICE_ENDPOINT_CTL_EPTYP_ISOCHRONOUS	(uint32_t)(1ul << 18ul)		//Isochronous EP type
#define  USB_HS_DEVICE_ENDPOINT_CTL_EPTYP_BULK			(uint32_t)(2ul << 18ul)		//Bulk EP type
#define  USB_HS_DEVICE_ENDPOINT_CTL_EPTYP_INTERRUPT	(uint32_t)(3ul << 18ul)		//Interrupt EP type

#define  USB_HS_DEVICE_ENDPOINT_CTL_MPSIZ0_64			(uint32_t)(0x0ul << 0ul)	//EP0 maximum packet size 64 bytes
#define  USB_HS_DEVICE_ENDPOINT_CTL_MPSIZ0_32			(uint32_t)(0x1ul << 0ul)	//EP0 maximum packet size 32 bytes
#define  USB_HS_DEVICE_ENDPOINT_CTL_MPSIZ0_16			(uint32_t)(0x2ul << 0ul)	//EP0 maximum packet size 16 bytes
#define  USB_HS_DEVICE_ENDPOINT_CTL_MPSIZ0_8				(uint32_t)(0x3ul << 0ul)	//EP0 maximum packet size 8 bytes

/************  Bit definition for USB_HS_DEVICE_ENDPOINT_INT register  *************/
#define  USB_HS_DEVICE_ENDPOINT_INT_NYET					(uint32_t)(1ul << 14ul)		//NYET interrupt
#define  USB_HS_DEVICE_ENDPOINT_INT_NAK					(uint32_t)(1ul << 13ul)		//NAK interrupt
#define  USB_HS_DEVICE_ENDPOINT_INT_BERR					(uint32_t)(1ul << 12ul)		//Babble error interrupt
#define  USB_HS_DEVICE_ENDPOINT_INT_PKTDRPSTS			(uint32_t)(1ul << 11ul)		//Packet dropped status
#define  USB_HS_DEVICE_ENDPOINT_INT_BNA					(uint32_t)(1ul << 9ul)		//BNA interrupt
#define  USB_HS_DEVICE_ENDPOINT_INT_TXFIFOUDRN			(uint32_t)(1ul << 8ul)		//Tx FIFO underrun
#define  USB_HS_DEVICE_ENDPOINT_INT_OPEM					(uint32_t)(1ul << 8ul)		//OUT packet error
#define  USB_HS_DEVICE_ENDPOINT_INT_TXFE					(uint32_t)(1ul << 7ul)		//Tx FIFO empty
#define  USB_HS_DEVICE_ENDPOINT_INT_INEPNE				(uint32_t)(1ul << 6ul)		//IN: endpoint NAK effective
#define  USB_HS_DEVICE_ENDPOINT_INT_B2BSTUP				(uint32_t)(1ul << 6ul)		//OUT: back-to-back SETUP packets received
#define  USB_HS_DEVICE_ENDPOINT_INT_ITXFE					(uint32_t)(1ul << 4ul)		//IN: token received, when TxFIFO empty
#define  USB_HS_DEVICE_ENDPOINT_INT_OTEPDIS				(uint32_t)(1ul << 4ul)		//OUT: token received when endpoint disabled
#define  USB_HS_DEVICE_ENDPOINT_INT_TOC					(uint32_t)(1ul << 3ul)		//IN: timeout condition
#define  USB_HS_DEVICE_ENDPOINT_INT_STUP					(uint32_t)(1ul << 3ul)		//OUT: setup phase done
#define  USB_HS_DEVICE_ENDPOINT_INT_AHB_ERROR			(uint32_t)(1ul << 2ul)		//OUT: setup phase done
#define  USB_HS_DEVICE_ENDPOINT_INT_EPDISD				(uint32_t)(1ul << 1ul)		//Endpoint disabled interrupt
#define  USB_HS_DEVICE_ENDPOINT_INT_XFRC					(uint32_t)(1ul << 0ul)		//Transfer completed interrupt

/************  Bit definition for USB_HS_DEVICE_ENDPOINT_TSIZ register  *************/
#define  USB_HS_DEVICE_ENDPOINT_TSIZ_PKTCNT_IN0			(uint32_t)(3ul << 19ul)		//IN0: packets count
#define  USB_HS_DEVICE_ENDPOINT_TSIZ_XFRSIZ_IN0			(uint32_t)(0x7ful << 0ul)	//IN0: transfer size

