alexeyk13/rexos/arch/cortex_m3/stm/stm32f2xx_regsusb.h
#define  USB_HS_DEVICE_ENDPOINT_TSIZ_STUPCNT_OUT0		(uint32_t)(3ul << 29ul)		//OUT0: setup packets count
#define  USB_HS_DEVICE_ENDPOINT_TSIZ_PKTCNT_OUT0		(uint32_t)(1ul << 19ul)		//OUT0: packets count
#define  USB_HS_DEVICE_ENDPOINT_TSIZ_XFRSIZ_OUT0		(uint32_t)(0x7ful << 0ul)	//OUT0: transfer size

#define  USB_HS_DEVICE_ENDPOINT_TSIZ_MCNT					(uint32_t)(3ul << 29ul)		//multi count
#define  USB_HS_DEVICE_ENDPOINT_TSIZ_RXDPID				(uint32_t)(3ul << 29ul)		//received data pid
#define  USB_HS_DEVICE_ENDPOINT_TSIZ_PKTCNT				(uint32_t)(0x3ful << 19ul)	//packets count
#define  USB_HS_DEVICE_ENDPOINT_TSIZ_XFRSIZ				(uint32_t)(0x7ffful << 0ul)//transfer size

#define  USB_HS_DEVICE_ENDPOINT_TSIZ_RXDPID_DATA0		(uint32_t)(0ul << 29ul)		//DATA0
#define  USB_HS_DEVICE_ENDPOINT_TSIZ_RXDPID_DATA2		(uint32_t)(1ul << 29ul)		//DATA1
#define  USB_HS_DEVICE_ENDPOINT_TSIZ_RXDPID_DATA1		(uint32_t)(2ul << 29ul)		//DATA1
#define  USB_HS_DEVICE_ENDPOINT_TSIZ_RXDPID_MDATA		(uint32_t)(3ul << 29ul)		//MDATA

#define  USB_HS_DEVICE_ENDPOINT_TSIZ_MCNT_POS			(uint32_t)(29ul)
#define  USB_HS_DEVICE_ENDPOINT_TSIZ_STUPCNT_OUT0_POS	(uint32_t)(29ul)
#define  USB_HS_DEVICE_ENDPOINT_TSIZ_PKTCNT_POS			(uint32_t)(19ul)
#define  USB_HS_DEVICE_ENDPOINT_TSIZ_XFRSIZ_POS			(uint32_t)(0ul)

/************  Bit definition for USB_HS_DEVICE_ENDPOINT_DMA register  *************/
#define  USB_HS_DEVICE_ENDPOINT_DMA_DMAADDR				(uint32_t)(0xfffffffful << 0ul)//DMA address

#define  USB_HS_DEVICE_ENDPOINT_DMA_DMAADDR_POS			(uint32_t)(0ul)

/************  Bit definition for USB_HS_DEVICE_ENDPOINT_FSTS register  *************/
#define  USB_HS_DEVICE_ENDPOINT_FSTS_INEPTFSAV			(uint32_t)(0xfffful << 0ul)	//IN EP TxFIFO space available

#define  USB_HS_DEVICE_ENDPOINT_FSTS_INEPTFSAV_POS		(uint32_t)(0ul)

/******************************************************************************/
/*                                                                            */
/*                            USB High Speed POWER & CLOCK                    */
/*                                                                            */
/******************************************************************************/
/************  Bit definition for USB_HS_PC_GCCTL register  *******************/
#define  USB_HS_PC_GCCTL_PHYSUSP								(uint32_t)(1ul << 4ul) //phy suspended
#define  USB_HS_PC_GCCTL_GATEHCLK							(uint32_t)(1ul << 1ul) //Gate HCLK
#define  USB_HS_PC_GCCTL_STPPCLK								(uint32_t)(1ul << 0ul) //Stop PHY clock

#endif // STM32F2XX_REGSUSB_H
